<?php

declare(strict_types=1);

return [
    'retry' => [
        'failed' => [
            'error' => [
                'body'  => 'خطا: :error',
                'title' => 'تلاش مجدد ناموفق بود',
            ],
            'none'     => 'دریافت‌کننده ناموفقی برای صف‌بندی مجدد وجود ندارد',
            'requeued' => 'تعداد :count دریافت‌کننده ناموفق دوباره در صف قرار گرفت',
        ],
        'no_post' => [
            'body'  => 'پستی برای تلاش مجدد وجود ندارد.',
            'title' => 'هیچ پستی یافت نشد',
        ],
    ],
    'send' => [
        'failed' => [
            'body'  => 'خطا: :error',
            'title' => 'ارسال خبرنامه ":newsletter" ناموفق بود',
        ],
        'success' => 'خبرنامه برای ارسال در صف قرار گرفت',
    ],
];
